xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal.c
  }
}

/**
  * @brief  Disable GPIO Noise Filter
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B,C,D) to select the GPIO peripheral for PY32T0 family
  * @param  GPIO_Pin specifies the pin to be Noise Filter
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_DisableGPIONoiseFilter(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    CLEAR_BIT(SYSCFG->PA_ENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    CLEAR_BIT(SYSCFG->PB_ENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOC)
  {
    CLEAR_BIT(SYSCFG->PC_ENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOD)
  {
    CLEAR_BIT(SYSCFG->PD_ENS,GPIO_Pin);
  }
  else
  {
    
  }
}
#endif

/**
  * @brief  GPIO Analog2 enable.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B,C,D) to select the GPIO peripheral for PY32T0 family
  * @param  GPIO_Pin specifies the pin to be GPIO Analog2
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_EnableGPIOAnalog2(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    SET_BIT(SYSCFG->PA_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    SET_BIT(SYSCFG->PB_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOC)
  {
    SET_BIT(SYSCFG->PC_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOD)
  {
    SET_BIT(SYSCFG->PD_ANA2EN,GPIO_Pin);
  }
  else
  {
    
  }
}

/**
  * @brief  GPIO Analog2 disable.
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A,B,C,D) to select the GPIO peripheral for PY32T0 family
  * @param  GPIO_Pin specifies the pin to be GPIO Analog2
  *         This parameter can be any combination of GPIO_PIN_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_DisableGPIOAnalog2(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    CLEAR_BIT(SYSCFG->PA_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    CLEAR_BIT(SYSCFG->PB_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOC)
  {
    CLEAR_BIT(SYSCFG->PC_ANA2EN,GPIO_Pin);
  }
  else if(GPIOx==GPIOD)
  {
    CLEAR_BIT(SYSCFG->PD_ANA2EN,GPIO_Pin);
  }
  else
  {
    
  }
}

/**
  * @brief  Enable I2C pin Signal.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EIIC_PA11
  *            @arg SYSCFG_EIIC_PA12
  *            @arg SYSCFG_EIIC_PA13
  *            @arg SYSCFG_EIIC_PA14
  *            @arg SYSCFG_EIIC_PB4  
  *            @arg SYSCFG_EIIC_PB5  
  *            @arg SYSCFG_EIIC_PB8  
  *            @arg SYSCFG_EIIC_PB9  
  *            @arg SYSCFG_EIIC_PB12 
  *            @arg SYSCFG_EIIC_PB13 
  *            @arg SYSCFG_EIIC_PD10 
  *            @arg SYSCFG_EIIC_PD11 
  *            @arg SYSCFG_EIIC_PC5  
  *            @arg SYSCFG_EIIC_PC6  
  *            @arg SYSCFG_EIIC_PC7  
  *            @arg SYSCFG_EIIC_PC9  
  *            @arg SYSCFG_EIIC_PC10 
  *            @arg SYSCFG_EIIC_PC12 
  *            @arg SYSCFG_EIIC_PC13 
  *            @arg SYSCFG_EIIC_PC14 
  *            @arg SYSCFG_EIIC_PC15 
  *            @arg SYSCFG_EIIC_PD6  
  *            @arg SYSCFG_EIIC_PD7  
  *            @arg SYSCFG_EIIC_PD14 
  *            @arg SYSCFG_EIIC_PD15 
  * @retval None
  */
void HAL_SYSCFG_EnableI2CPinSignal(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Disable I2C pin Signal.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EIIC_PA11
  *            @arg SYSCFG_EIIC_PA12
  *            @arg SYSCFG_EIIC_PA13
  *            @arg SYSCFG_EIIC_PA14
  *            @arg SYSCFG_EIIC_PB4  
  *            @arg SYSCFG_EIIC_PB5  
  *            @arg SYSCFG_EIIC_PB8  
  *            @arg SYSCFG_EIIC_PB9  
  *            @arg SYSCFG_EIIC_PB12 
  *            @arg SYSCFG_EIIC_PB13 
  *            @arg SYSCFG_EIIC_PD10 
  *            @arg SYSCFG_EIIC_PD11 
  *            @arg SYSCFG_EIIC_PC5  
  *            @arg SYSCFG_EIIC_PC6  
  *            @arg SYSCFG_EIIC_PC7  
  *            @arg SYSCFG_EIIC_PC9  
  *            @arg SYSCFG_EIIC_PC10 
  *            @arg SYSCFG_EIIC_PC12 
  *            @arg SYSCFG_EIIC_PC13 
  *            @arg SYSCFG_EIIC_PC14 
  *            @arg SYSCFG_EIIC_PC15 
  *            @arg SYSCFG_EIIC_PD6  
  *            @arg SYSCFG_EIIC_PD7  
  *            @arg SYSCFG_EIIC_PD14 
  *            @arg SYSCFG_EIIC_PD15 
  * @retval None
  */
void HAL_SYSCFG_DisableI2CPinSignal(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Enable high driving capability of LED pins.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EHS_PB2 
  *            @arg SYSCFG_EHS_PB3 
  *            @arg SYSCFG_EHS_PB4 
  *            @arg SYSCFG_EHS_PB5 
  *            @arg SYSCFG_EHS_PB6 
  *            @arg SYSCFG_EHS_PB7 
  *            @arg SYSCFG_EHS_PB8 
  *            @arg SYSCFG_EHS_PB9 
  * @retval None
  */
void HAL_SYSCFG_EnableLEDPinHighDrvSignal(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->LEDCFG, PORT_Pin);
}

/**
  * @brief  Disable high driving capability of LED pins.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_EHS_PB2 
  *            @arg SYSCFG_EHS_PB3 
  *            @arg SYSCFG_EHS_PB4 
  *            @arg SYSCFG_EHS_PB5 
  *            @arg SYSCFG_EHS_PB6 
  *            @arg SYSCFG_EHS_PB7 
  *            @arg SYSCFG_EHS_PB8 
  *            @arg SYSCFG_EHS_PB9 
  * @retval None
  */
void HAL_SYSCFG_DisableLEDPinHighDrvSignal(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->LEDCFG, PORT_Pin);
}

/**
  * @brief  Enable I2C pin pull-up.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_PU_IIC_PD14
  *            @arg SYSCFG_PU_IIC_PD15
  * @retval None
  */
void HAL_SYSCFG_EnableI2CPinPullUp(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Disable I2C pin pull-up.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_PU_IIC_PD14
  *            @arg SYSCFG_PU_IIC_PD15
  * @retval None
  */
void HAL_SYSCFG_DisableI2CPinPullUp(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Enable SEG Constant Current Source.
  * @param  SEGx specifies the seg
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_SEGIS_EN_0
  *            @arg SYSCFG_SEGIS_EN_1
  *            @arg SYSCFG_SEGIS_EN_2
  *            @arg SYSCFG_SEGIS_EN_3
  * @retval None
  */
void HAL_SYSCFG_EnableSEGConstantCurrentSource(uint32_t SEGx)
{
  SET_BIT(SYSCFG->LEDCFG, SEGx);
}

/**
  * @brief  Disable SEG Constant Current Source.
  * @param  SEGx specifies the seg
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_SEGIS_EN_0 
  *            @arg SYSCFG_SEGIS_EN_1 
  *            @arg SYSCFG_SEGIS_EN_2 
  *            @arg SYSCFG_SEGIS_EN_3 
  * @retval None
  */
void HAL_SYSCFG_DisableSEGConstantCurrentSource(uint32_t SEGx)
{
  CLEAR_BIT(SYSCFG->LEDCFG, SEGx);
}

/**
  * @brief  Enable GPIO Constant Current Source.
  * @param  GPIOx specifies the GPIO
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_ENSEG_PB2 
  *            @arg SYSCFG_ENSEG_PB3 
  *            @arg SYSCFG_ENSEG_PB4 
  *            @arg SYSCFG_ENSEG_PB5 
  *            @arg SYSCFG_ENSEG_PB6 
  *            @arg SYSCFG_ENSEG_PB7 
  *            @arg SYSCFG_ENSEG_PB8 
  *            @arg SYSCFG_ENSEG_PB9 
  *            @arg SYSCFG_ENSEG_PB10
  *            @arg SYSCFG_ENSEG_PB11
  *            @arg SYSCFG_ENSEG_PB12
  *            @arg SYSCFG_ENSEG_PB13
  *            @arg SYSCFG_ENSEG_PB14
  *            @arg SYSCFG_ENSEG_PB15
  *            @arg SYSCFG_ENSEG_PC0 
  *            @arg SYSCFG_ENSEG_PC1 
  * @retval None
  */
void HAL_SYSCFG_EnableGPIOConstantCurrentSource(uint32_t GPIOx)
{
  SET_BIT(SYSCFG->LEDCFG, GPIOx);
}

/**
  * @brief  Disable GPIO Constant Current Source..
  * @param  GPIOx specifies the seg
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_ENSEG_PB2 
  *            @arg SYSCFG_ENSEG_PB3 
  *            @arg SYSCFG_ENSEG_PB4 
  *            @arg SYSCFG_ENSEG_PB5 
  *            @arg SYSCFG_ENSEG_PB6 
  *            @arg SYSCFG_ENSEG_PB7 
  *            @arg SYSCFG_ENSEG_PB8 
  *            @arg SYSCFG_ENSEG_PB9 
  *            @arg SYSCFG_ENSEG_PB10
  *            @arg SYSCFG_ENSEG_PB11
  *            @arg SYSCFG_ENSEG_PB12
  *            @arg SYSCFG_ENSEG_PB13
  *            @arg SYSCFG_ENSEG_PB14
  *            @arg SYSCFG_ENSEG_PB15
  *            @arg SYSCFG_ENSEG_PC0 
  *            @arg SYSCFG_ENSEG_PC1 
  * @retval None
  */
void HAL_SYSCFG_DisableGPIOConstantCurrentSource(uint32_t GPIOx)
{
  CLEAR_BIT(SYSCFG->LEDCFG, GPIOx);
}

/** @brief SRAM page write protection enable
  * @param Page: This parameter is a long 32bit value and can be a value of @ref SYSCFG_SRAMWRP
  * @note  write protection can only be disabled by a system reset
  * @retval None
  */
void HAL_SYSCFG_SRAM_WriteProtectionEnable(uint32_t Page)
{
  SET_BIT(SYSCFG->SWPR, (uint32_t)(Page));
}

#if defined(VREFBUF)
/**
  * @brief  Enable the Internal Voltage Reference buffer (VREFBUF).
  * @retval None
  */
void HAL_SYSCFG_EnableVREFBUF(void)
{
  SET_BIT(VREFBUF->CR, VREFBUF_CR_VREFBUF_EN);
}

/**
  * @brief  Disable the Internal Voltage Reference buffer (VREFBUF).
  * @retval None
  */
void HAL_SYSCFG_DisableVREFBUF(void)
{
  CLEAR_BIT(VREFBUF->CR, VREFBUF_CR_VREFBUF_EN);
}

/**
  * @brief  Configure the Internal Voltage Reference buffer (VREFBUF).
  * @param  Vrefbuf specifies the vrebuf voltage level
  *         This parameter can be any combination of the following values:
  *            @arg SYSCFG_VREFBUF_1P024V
  *            @arg SYSCFG_VREFBUF_1P5V  
  *            @arg SYSCFG_VREFBUF_2P048V
  *            @arg SYSCFG_VREFBUF_2P5V  
  *            @arg SYSCFG_VREFBUF_0P6V  
  * @retval None
  */
void HAL_SYSCFG_VREFBUFConfig(uint32_t Vrefbuf)
{
  MODIFY_REG(VREFBUF->CR, (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL), Vrefbuf);
}

#endif /* VREFBUF */

/**
  * @}
  */



/**
  * @}
  */

#endif /* HAL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
